# CreateTile

## Description
Creates a new tile resource.

```pascal
FUNCTION CreateTile(tileName : STRING): HANDLE;
```

```python
def vs.CreateTile(tileName):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileName|STRING|A user-specified name by which the newly created tile will be identified.|

## Examples
```pascal
tileHandle := CreateTile('My Tile');
```

```pascal
resultH := CreateTile('Example');
```
```python
import vs

# Creates a new tile resource.
tileName = 'Example'

objHandle = vs.CreateTile(tileName)
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Document Attributes